FINGERS = {
          '散音':0,'大指':1,'食指':1,'中指':1,'名指':1,'跪指':1,
          #,'就',
          #'进','退','复进','复退','复','引上','淌下','往来','撞','掐起','带起',
          #'罨','推出','不动',

          '擘':1,'托':1,'抹':1,'挑':1,'勾':1,'剔':1,'打':1,'摘':1,'抹挑':1,'勾剔':1,
          '历':2,
          # '蠲','轮','琐','长琐',
          #'如一声','双弹','拨','剌','拨剌','伏','撮','打圆','滚','拂','滚拂','全扶'

          '分开':0,'同声':0,'应合':0,'放合':0,'掐撮声':0,'掐撮三声':0
          }


XIAN = ['一弦','二弦','三弦','四弦','五弦','六弦','七弦']
HUI = ['一徽','二徽','三徽','四徽','五徽','六徽','七徽','八徽','九徽','十徽','十一徽','十二徽','十三徽','徽外']
FEN = ['一分','二分','三分','四分','五分','六分','七分','八分','九分','半']

MODIFIERS = ['注','绰','吟','猱','上','下','急','缓','紧','慢']

MARKERS = ['泛起','泛止', # 泛音、音符号不单独出现注明，散音视为一种特殊的左手指法（即无指法），省略之
          '少息','大息','入拍','入慢','。','间','再作','从头再作','曲终','操终']